program(1).
rule(1, 1). phead(1, 1, 'x0'). nhead(1, 1, 'x0'). nbody(1, 1, 'x1').
rule(1, 2). pbody(1, 2, 'x0'). nbody(1, 2, 'x1').
rule(1, 3). phead(1, 3, 'x1'). nhead(1, 3, 'x1'). nbody(1, 3, 'x0').
rule(1, 4). phead(1, 4, 'x1'). phead(1, 4, 'x0'). nhead(1, 4, 'x1'). nhead(1, 4, 'x0').
rule(1, 5). phead(1, 5, 'x1'). nhead(1, 5, 'x1'). pbody(1, 5, 'x0').
